'''

运算符	描述	                                     实例
+	加 - 两个对象相加	                        a + b 输出结果 31
-	减 - 得到负数或是一个数减去另一个数	        a - b 输出结果 -11
*	乘 - 两个数相乘或是返回一个被重复若干次的字符串	a * b 输出结果 210
/	除 - x 除以 y	                        b / a 输出结果 2.1
%	取模 - 返回除法的余数	                    b % a 输出结果 1
**	幂 - 返回x的y次幂	                        a**b 为10的21次方
//	取整除 - 向下取接近商的整数

'''

# 多个变量赋值
# a,b,c=10,20,0
a=10
b=20


# 加
c=a+b
print('a+b的值为:',c)
# 减
c=a-b
print('a-b的值为:',c)
# 乘
c=a*b
print('a*b的值为:',c)
# 除
c=a/b
print('a/b的值为:',c)
# 取模(取余)
c=a%b
print('a%b的值为:',c)
# 幂
c=a**b
print('a**b的值为:',c)
# 取整除
d=9
e=2
f=d//e
print('d//e的值为:',f)